let hf = require('help-functions');
console.log('\n' + gl_hr + '\n' +'РЕЗУЛЬТАТ ФАЙЛА : ' + __filename.substring(__filename.indexOf('snippetjs-demo') + 20), '\n' + gl_hr);
// hf.fil.fileToLog('path')
//-------------------------------СОДЕРЖИМОЕ ФАЙЛА--------------------------------------

function run() {
	//Ваш код, скорость, которого собираетесь отследить--------------------------------
	let j = 0;
	while(j++, j < 1000) {	console.log(j); }
	//---------------------------------------------------------------------------------
};
exports.run = run;

//Количество циклов--------------------------------------------------------------------
exports.timerCycles = 1;
//-------------------------------------------------------------------------------------
